<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="CtCategorySequenceSoftware">Sequence Software</string>      
</stringTable>	    	
  </resources>
</policyDefinitionResources>